# CreateThumbnailPopup

## Description
Creates a thumbnail popup that can be populated with previews of objects in Vectorworks

```pascal
PROCEDURE CreateThumbnailPopup(
				dialogID  : LONGINT;
				controlID : LONGINT);
```

```python

def vs.CreateThumbnailPopup(dialogID, controlID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|controlID|LONGINT||

## Version
Availability: from Vectorworks 2012
## Category
* Dialogs - Modern